# FilterNumericGreater Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericGreater Constructor
FilterNumericGreater Class See Also
---
Constructs an instance of FilterNumericGreater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericGreater()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterNumericGreater()
```

# See Also
FilterNumericGreater Class
Autodesk.Revit.DB Namespace